<template lang="pug">
.grid
	.left
		.zg Общие сведения o Web-клиенте
		p Модуль Docsvision 5. Web-клиент предназначен для применения в организациях, в которых используется СЭД Docsvision.

		p Docsvision 5. Web-клиент является дополнительным модулем системы Docsvision 5.5. Web-клиент предоставляет возможность работать с карточками системы Docsvision и осуществлять основные операции с электронными документами в веб-браузере на персональном компьютере и на мобильном устройстве.
		br
		#one.zag Функции Web-клиента
		q-separator
		br
		p Web-клиент не является автономным, он обеспечивает выполнение следующих функциональных задач:

		p Работа с документами:
		ul
			li Создание и просмотр документов.
			li Просмотр в веб-браузере файлов офисных и графических форматов, приложенных к документам.
			li Согласование документов с использованием расширенных маршрутов согласования приложения Docsvision 5. Конструктор согласований.

		p Работа с заданиями:
		ul
			li Создание, просмотр и отправка на исполнение заданий.
			li Исполнение или делегирование поступивших на исполнение заданий.
			li Просмотр приложенных к заданиям файлов офисных и графических форматов в веб-браузере.
			li Создание подчинённых заданий и групп заданий.

		p Поиск карточек:
		ul
			li В выбранной папке.
			li По всей базе данных с помощью полнотекстового поиска.



		br
		#two.zag Конструктор Web-разметок
		q-separator
		br
		p Конструктор Web-разметок — программа для настройки разметок модуля Web-клиент.

		p Программа Конструктор Web-разметок предназначена для применения в организациях, в которых используется система Docsvision и модуль Docsvision 5. Web-клиент.

		p Возможности программы Конструктор Web-разметок:
		ul
			li Настройка разметок карточек, дерева папок, дашборда, а также других элементов Web-клиента, с помощью встроенного редактора.
			li Настройка условий использования разметки в зависимости от типа устройства, роли сотрудника, состояния карточки, а также других условий. Список возможных условий выбора разметки определяется её назначением.
			li Настройка Решений — комплект настроек, содержащий разметки, данные локализации и условия выбора разметок.
			li Экспорт/импорт Решений и др.
			li Создание расширенных маршрутов согласования.
			li Использование сценариев (язык JavaScript) для обработки событий разметки.
			li Локализация разметок.
			li Разработка новых элементов управления для настройки разметок.
			li Разработка серверных расширений для получения дополнительной серверной бизнес-логики.

		br
		#three.zag Администрирование
		q-separator
		br
		p Раздел администрирование содержит инструкцию по установке Web-клиента, описание функций администратора Docsvision, инструкцию по настройке дерева папок и дашборда, а также описание других задач по администрированию:
		ol
			li Установка и настройка содержит инструкцию по установке и первоначальной настройке Web-клиента, инструкцию по обновлению и настройке кластера Web-клиента.
			li Функции администратора содержит описание программы Панель управления Web-клиентом, перечислены действия, выполняемые администратором Docsvision.

		#four.zag Расширение возможностей
		q-separator
		br
		p.text-weight-bold Расширение функциональных возможностей
		p Функциональные возможности серверной части Web-клиента могут быть увеличены с помощью серверных расширений. С помощью данного типа расширений в сервер Web-клиента могут быть добавлены новые методы WebAPI (в т. ч. реализующие серверную бизнес-логику карточек); дополнительные данные, необходимые для формирования пользовательского интерфейса Модуля (в т. ч. новых элементов управления); методы, обеспечивающие возможность создания новых типов карточек из меню создания карточек; и др.
		p Функциональные возможности клиентской части Web-клиента могут быть увеличены с помощью клиентских расширений и клиентских скриптов. В клиентских расширениях могут быть реализованы новые общие функции, доступные всем клиентским компонентам Модуля, а также клиентские компоненты элементов управления. Клиентские скрипты добавляют в Модуль функции-обработчики для событий элементов разметок, настраиваемых в программе Конструктор Web-разметок.
		p.text-weight-bold Расширение возможностей программы Конструктор Web-разметок
		p Конструктор Web-разметок также предоставляет возможность расширять свою функциональность с помощью дополнительных компонентов. С помощью расширений программы Конструктор Web-разметок могут быть добавлены новые типы элементов управления и связанные с ними сущности.



	.side
		.sod Содержание
		.list
			div(@click="handleScroll('one')") Функции Web-клиента
			div(@click="handleScroll('two')") Конструктор Web-разметок
			div(@click="handleScroll('three')") Администрирование
			div(@click="handleScroll('four')") Расширение возможностей
</template>

<script setup lang="ts">
import { ref } from 'vue'
import { scroll } from 'quasar'
const { getScrollTarget, setVerticalScrollPosition } = scroll

const handleScroll = (e: string) => {
	const ele = document.getElementById(e) // You need to get your element here
	const target = getScrollTarget(ele!)
	const offset = ele!.offsetTop - 75
	const duration = 300
	setVerticalScrollPosition(target, offset, duration)
}
</script>

<style scoped lang="scss">
.grid {
	padding: 2rem;
	display: grid;
	grid-template-columns: 1fr 300px;
	gap: 1rem;
}
</style>
